package Lections;

public class Main {
    public static void main(String[] args){
        Functions.Собака собака1 = new Functions.Собака();
        Functions.Собака собака2 = new Functions.Собака();

        собака1.кличка = " Палкан";
        собака1.порода = " Алабай";
        собака1.возраст = 15;

        собака2.порода = " Чихуахуа";
        собака2.кличка = " Чуня";
        собака2.возраст = 2;

//        собака1.ктоТы();
//        собака2.ктоТы();

//        собака2.отметьДР();
//        собака1.отметьДР();

        собака1.скажиГав(2);
        собака2.скажиГав(5);


    }
}
