package JavaSyntax.ModuleOne.Theory_JR.Function;

public class Strings {
    // Экранирование символов:
    // \t	Вставить символ табуляции
    // \b	Вставить символ возврата на один символ
    // \n	Вставить символ новой строки
    // \r	Вставить символ возврата каретки
    // \f	Вставить символ прогона страницы
    // \'	Вставить одинарную кавычку
    // \"	Вставить двойную кавычку
    // \\	Вставить обратный слеш

    // Методы класса String
    //int length() - Возвращает количество символов в строке
    //boolean isEmpty() - Проверяет, что строка == пустая строка
    //boolean isBlank() - Проверяет, что в строке — только whitespace-символы: пробел, tab, enter и т.п.
    //char charAt(int index) - Возвращает символ, который стоит на index-позиции в строке.
    //char[] toCharArray() - Возвращает массив символов (копию), из которых состоит строка
    //byte[] getBytes() - Преобразует строку в набор байт и возвращает массив байт.
    //String[] split(String regex) - Разделяет строку на несколько подстрок.
    //String join(CharSequence delimiter, elements) - Склеивает вместе несколько подстрок
    //String intern() - Помещает строку в пул StringPool.


}
