package JavaSyntax.ModuleOne.Theory_JR.Object;

public class Object1 {
    //Объект — это сгруппированные вместе данные и методы для того, чтобы эти данные обрабатывать.
    // Когда мы говорим о данных, имеем в виду переменные, конечно.

    //Про переменные объекта говорят, что это «данные объекта» или «состояние объекта».
    //
    //Про методы объекта говорят: это «поведение объекта».
    // Состояние объекта (переменные объекта) принято менять только с помощью методов того же объекта.

    //У каждого объекта, как и у каждой переменной, есть тип.
    // Этот тип определяется один раз при создании объекта и поменять его в дальнейшем нельзя.
    // Типом объекта считается его класс.

    //Самый удобный способ работы с объектом — сохранить ссылку на объект в переменную,
    // и потом вызывать методы у этой переменной.
    //      переменная.метод()
    //Где переменная — это переменная, которая хранит в себе ссылку на объект, а метод — это метод класса объекта.
//Если вы хотите обратиться к полю (переменной) объекта, то тоже нужно использовать оператор точка:
    //       переменная.поле
    //Где переменная — это переменная, которая хранит в себе ссылку на объект, а поле — это переменная класса (поле объекта).

    //Чтобы создать объект определенного класса, нужно воспользоваться оператором new.
    // Вот как выглядит создание объекта в общем случае:
    //          Класс переменная = new Класс(параметры);

    //Где Класс — это имя класса для объявления переменной и имя класса создаваемого объекта.
    //Переменная — это переменная, в которую сохраняется ссылка на созданный объект.
    //А параметры — это параметры метода создания объекта.




}
