package JavaSyntax.ModuleOne;

import java.util.Scanner;

import static java.lang.Math.PI;

public class LevelTwo {
    public static void main(String[] args){
//1. Считай с клавиатуры три целых числа. Выведи на экран их среднее арифметическое.
//   Пример ввода: 50 101 201 Пример вывода: 117 Среднее арифметическое - это число, равное сумме всех чисел,
//   деленной на их количество. Используй деление без остатка
//        Scanner scanner = new Scanner(System.in);
//        int a = 50;
//        int b = 101;
//        int c = 201;
//        int d = (a + b + c)/3;
//        System.out.println(d);

//2. Считай с клавиатуры три строки.
//А затем:
//Выведи на экран третью строку в неизменном виде.
//Выведи на экран вторую строку, предварительно преобразовав ее к верхнему регистру.
//Выведи на экран первую строку, предварительно преобразовав ее к нижнему регистру.
//        Scanner scanner = new Scanner(System.in);
//        String one = "СТРОКА НОМЕР РАЗ";
//        String two = "Вторая строка";
//        String three = "Строка 3";
//        System.out.println(three);
//        System.out.println(two.toUpperCase());
//        System.out.println(one.toLowerCase());

//3. Для решения этой задачи нужно:
// 1. Ввести с клавиатуры положительное целое число radius. Это будет радиус окружности.
// 2. Вывести на экран площадь круга, рассчитанную по формуле: S = pi * radius * radius.
// Результатом должно стать целое число (тип int). Для этого нужно привести к типу int результат
//        Scanner scanner = new Scanner(System.in);
//        int radius = scanner.nextInt();
//        double S = (int) (PI * radius * radius);
//
//        System.out.println(S);

      }
}
